---
kind: enumMember
id: F:Autodesk.Revit.DB.Analysis.gbXMLExportComplexity.Complex
enum: Autodesk.Revit.DB.Analysis.gbXMLExportComplexity
source: html/f1e171a8-a220-13c0-a088-853f43003bb8.htm
---
# Autodesk.Revit.DB.Analysis.gbXMLExportComplexity.Complex

Using this enumeration, Curtain Walls and Curtain Systems will
 exported as several openings, panel by panel.